## importation

In [1]:
import pandas as pd
import numpy as np

## read data

In [2]:
df=pd.read_csv('job.csv', encoding='latin1')
df.head()

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",",,,,"
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",",,,,"
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,NaN,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...","Career development,,,,"
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,"
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K+,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi..."

## info about my data

In [3]:
# df.tail()

In [4]:
# df.sample(10)

In [5]:
# check for null values
df.isnull().sum()

Company                         1
Job Title                       1
Location                        1
Job Type                        1
Experience level              236
Salary                        189
Requirment of the company       0
Facilities                      0
dtype: int64

In [6]:
# where the company name is null
df[df['Company'].isnull()]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
797,NaN,NaN,NaN,NaN,NaN,NaN,",,,,,",",,,,"

In [7]:
# drop the null row where the company name is null
df.dropna(subset=['Company'], inplace=True)
df.isnull().sum()

Company                         0
Job Title                       0
Location                        0
Job Type                        0
Experience level              235
Salary                        188
Requirment of the company       0
Facilities                      0
dtype: int64

## Column-wise null values percentage

In [8]:
df.isnull().sum()/df.shape[0]*100

Company                       0.000000
Job Title                     0.000000
Location                      0.000000
Job Type                      0.000000
Experience level              7.350641
Salary                        5.880513
Requirment of the company     0.000000
Facilities                    0.000000
dtype: float64

## Cheacking the data type and non null value present in the dataframe

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3197 entries, 0 to 3197
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     3197 non-null   object
 1   Job Title                   3197 non-null   object
 2   Location                    3197 non-null   object
 3   Job Type                    3197 non-null   object
 4   Experience level            2962 non-null   object
 5   Salary                      3009 non-null   object
 6   Requirment of the company   3197 non-null   object
 7   Facilities                  3197 non-null   object
dtypes: object(8)
memory usage: 224.8+ KB

## Fill the missing values in the Age column with "Not specified"

In [10]:
# Fill the missing values in the Age column with "Not specified"
df["Experience level"].fillna("Not specified", inplace=True)

## Cheking the dublicate value presant in the dataset

In [11]:
df.duplicated().sum()

202

In [12]:
df.drop_duplicates(inplace=True)

In [13]:
# print duplicate rows based on all columns
df[df.duplicated()].sort_values(by=['Job Title']).head(20)

Empty DataFrame
Columns: [Company, Job Title, Location, Job Type, Experience level, Salary, Requirment of the company , Facilities]
Index: []

In [14]:
# drop duplicates
df.drop_duplicates(inplace=True)
df[df.duplicated()].sort_values(by=['Job Title']).head()

Empty DataFrame
Columns: [Company, Job Title, Location, Job Type, Experience level, Salary, Requirment of the company , Facilities]
Index: []

In [15]:
df[df.duplicated(subset=['Company'])].count()

Company                       1889
Job Title                     1889
Location                      1889
Job Type                      1889
Experience level              1889
Salary                        1794
Requirment of the company     1889
Facilities                    1889
dtype: int64

In [16]:
df.drop_duplicates()

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",",,,,"
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",",,,,"
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,Not specified,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...","Career development,,,,"
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,"
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K+,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi..."
...,...,...,...,...,...,...,...,...
3190,CCRi,"Application Integration Engineer, Computer Vis...","Chantilly, Virginia, United States",Full Time,Mid-level,113K+,"Agile,Angular,APIs,Architecture,AWS,Azure","401(k) matching,Career development,Flex hours,..."
3191,Publicis Groupe,"Associate Director, Data Science","New York City, United States",Full Time,Mid-level,106K+,"Bayesian,Classification,Clustering,Data analys...","Career development,Health care,,,"
3192,DoorDash,"Senior Software Engineer, Machine Learning - A...","Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior-level,176K+,"Computer Science,Data analysis,Engineering,Exc...","401(k) matching,Career development,Equity,Insu..."
3193,Western Digital,Data Scientist - New College Graduate,"Biñan, Philippines",Full Time,Entry-level,39K+ *,"APIs,Clustering,Computer Science,Data visualiz...","Career development,,,,"
3196,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39K+ *,"Computer Science,Data Analytics,Data Mining,Ec...","Career development,Startup environment,,,"

## Remove ',,,,' character only from cells that contain it in the "Facilities" column

In [21]:
# Remove ',' character only from cells that contain it in the "Salary" column
 df['Facilities'] = df['Facilities'].apply(lambda x: x.replace(',,,,', 'Not-Specified') if isinstance(x, str) else x)

IndentationError: unexpected indent (3809845812.py, line 2)

In [18]:
# remove , if it is succeeded by a , in the Facilities column
df['Facilities'] = df['Facilities'].str.replace(r',,,,', '')
df['Facilities'] = df['Facilities'].str.replace(r',,,', '')
df['Facilities'] = df['Facilities'].str.replace(r',,', '')

In [19]:
df['Facilities'].fillna('Not-Specified', inplace=True)

In [20]:
df

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",
1,Ocorian,AML/CFT & Data Analyst,"Ebène, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,Not specified,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...",Career development
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K+,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi..."
...,...,...,...,...,...,...,...,...
3190,CCRi,"Application Integration Engineer, Computer Vis...","Chantilly, Virginia, United States",Full Time,Mid-level,113K+,"Agile,Angular,APIs,Architecture,AWS,Azure","401(k) matching,Career development,Flex hours,..."
3191,Publicis Groupe,"Associate Director, Data Science","New York City, United States",Full Time,Mid-level,106K+,"Bayesian,Classification,Clustering,Data analys...","Career development,Health care"
3192,DoorDash,"Senior Software Engineer, Machine Learning - A...","Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior-level,176K+,"Computer Science,Data analysis,Engineering,Exc...","401(k) matching,Career development,Equity,Insu..."
3193,Western Digital,Data Scientist - New College Graduate,"Biñan, Philippines",Full Time,Entry-level,39K+ *,"APIs,Clustering,Computer Science,Data visualiz...",Career development
3196,ATB Financial,Data Scientist,"Edmonton, Alberta, Canada",Full Time,Entry-level,39K+ *,"Computer Science,Data Analytics,Data Mining,Ec...","Career development,Startup environment"

In [ ]:
df.isnull().sum()

In [ ]:
Data Analyst
Data Scientist
Power BI Developer
BI Analyst
Data Engineer
Data Project Management
AWS Cloud Logistics
Product Analytics
Data Manager
Business Intelligence
Data Architect
Data Developer
Machine Learning
Software Engineer

In [ ]:
df["Job Title"].unique().tolist()

## remove the '+' symbol is present in the "Salary" column

In [ ]:
# Function to check if the '+' symbol is present in the "Salary" column
def check_salary_beyond(salary):
    return True if isinstance(salary, str) and '+' in salary else False

# Add a new column "the salary may go beyond" and populate it based on the check
df['the salary may go beyond'] = df['Salary'].apply(check_salary_beyond)

In [ ]:
# Remove '+' character only from cells that contain it in the "Salary" column
df['Salary'] = df['Salary'].apply(lambda x: x.replace('+', '') if isinstance(x, str) else x)

## remove the ' * ' symbol is present in the "Salary" column

In [ ]:
# Function to check if the '*' symbol is present in the "Salary" column
def check_additional_conditions(salary):
    return True if isinstance(salary, str) and '*' in salary else False

# Add a new column "there are additional conditions or footnotes" and populate it based on the check
df['there are additional conditions or footnotes'] = df['Salary'].apply(check_additional_conditions)

In [ ]:
# Remove '*' character only from cells that contain it in the "Salary" column
df['Salary'] = df['Salary'].apply(lambda x: x.replace('*', '') if isinstance(x, str) else x)

In [ ]:
# Remove ',' character only from cells that contain it in the "Salary" column
df['Salary'] = df['Salary'].apply(lambda x: x.replace('K', '') if isinstance(x, str) else x)

In [ ]:
# Function to convert salary from GBP to USD
def convert_to_usd(salary):
    if isinstance(salary, str) and 'EUR' in salary:
        salary_value = float(salary.replace('EUR', '').replace(',', '').strip())
        return salary_value * 1.1
    return salary

# Apply the function to the "Salary" column
df['Salary'] = df['Salary'].apply(convert_to_usd)

In [ ]:
# Function to convert salary from GBP to USD
def convert_to_usd(salary):
    if isinstance(salary, str) and 'GBP' in salary:
        salary_value = float(salary.replace('GBP', '').replace(',', '').strip())
        return salary_value * 1.3
    return salary

# Apply the function to the "Salary" column
df['Salary'] = df['Salary'].apply(convert_to_usd)

## multiply salary by 1000 because we removed 'K'

In [ ]:
# Function to multiply salary by 1000
def multiply_1000(salary):
    if isinstance(salary, str):
        return float(salary.replace('K', '')) * 1000
    return salary

# Apply the function to the "Salary" column
df['Salary'] = df['Salary'].apply(multiply_1000)

## replace the null values in the Salary column with 0

In [ ]:
# replace the null values in the Salary column with 0
df['Salary'].fillna('Negociable', inplace=True)
df.isnull().sum()

## extract country names from the "Location" column

In [ ]:
import pycountry

# Function to check if the word represents a country
def is_country(word):
    return any(country.name.lower() == word.lower() for country in pycountry.countries)

# Function to extract country names from the "Location" column
def extract_country(location):
    if isinstance(location, str):
        words = location.split(',')
        for word in words:
            if is_country(word.strip()):
                return word.strip()
    return None

# Add a new column "country" with the extracted country names
df['country'] = df['Location'].apply(extract_country)

In [ ]:
# Split "Location" into "city" and "country" columns
df[['city', 'country']] = df['Location'].str.split(', ', n=1, expand=True)

In [ ]:
# Add a new column with the result of the code df["Location"].str.lower().str.contains("remote", na=False)
df['is_remote'] = df["Location"].str.lower().str.contains("remote", na=False)

In [ ]:
df.loc[df["Location"]=='Remote']

In [ ]:
df["Location"].str.lower().str.contains("remote", na=False)

## Traduire les "Job Title" en anglais:

In [ ]:
from googletrans import Translator

In [ ]:
# Create an instance of the Translator class
translator = Translator()

In [ ]:
# Define a function to translate a text using the Googletrans library
def translate_text(text):
    try:
        return translator.translate(text, dest='en').text
    except:
        return "Translation Error"

In [ ]:
# Apply the translate_text function to the "description" column of the DataFrame
df['Job Title'] = df['Job Title'].apply(translate_text)

In [ ]:
df[df.duplicated(subset=['Company'])]

In [ ]:
df['Experience level'].value_counts()

In [ ]:
df['Job Type'].value_counts()

In [ ]:
df['Company'].value_counts()

In [ ]:
df['Location'].value_counts()

In [ ]:
df

In [ ]:
df.country.unique()

In [ ]:
# Write the data to the CSV file
df.to_csv('updated_dataset.csv', index=False)

In [ ]:
# Save the updated DataFrame to an Excel file
df.to_excel('updated_dataset.xlsx', index=False)